; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob71) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate10)
	(at pallet1 depot1)
	(clear crate7)
	(at pallet2 depot2)
	(clear crate9)
	(at pallet3 distributor0)
	(clear crate3)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 depot0)
	(clear crate6)
	(at pallet7 depot1)
	(clear pallet7)
	(at pallet8 distributor0)
	(clear pallet8)
	(at truck0 depot1)
	(at truck1 distributor2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor1)
	(available hoist6)
	(at hoist7 distributor0)
	(available hoist7)
	(at hoist8 depot2)
	(available hoist8)
	(at hoist9 depot1)
	(available hoist9)
	(at hoist10 distributor2)
	(available hoist10)
	(at hoist11 distributor1)
	(available hoist11)
	(at crate0 distributor0)
	(on crate0 pallet3)
	(at crate1 depot2)
	(on crate1 pallet2)
	(at crate2 depot1)
	(on crate2 pallet1)
	(at crate3 distributor0)
	(on crate3 crate0)
	(at crate4 depot1)
	(on crate4 crate2)
	(at crate5 depot0)
	(on crate5 pallet6)
	(at crate6 depot0)
	(on crate6 crate5)
	(at crate7 depot1)
	(on crate7 crate4)
	(at crate8 depot2)
	(on crate8 crate1)
	(at crate9 depot2)
	(on crate9 crate8)
	(at crate10 depot0)
	(on crate10 pallet0)
)

(:goal (and
		(on crate0 crate8)
		(on crate1 pallet5)
		(on crate2 crate5)
		(on crate3 pallet7)
		(on crate4 crate3)
		(on crate5 pallet3)
		(on crate6 crate0)
		(on crate7 pallet1)
		(on crate8 pallet8)
		(on crate9 pallet2)
	)
))

; plan
1. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   goals met: 0 of 10
2. (lift hoist2 crate9 crate8 depot2)
   deleted: (at crate9 depot2) (clear crate9) (available hoist2) (on crate9 crate8)
   added: (lifting hoist2 crate9) (clear crate8)
   goals met: 0 of 10
3. (lift hoist0 crate6 crate5 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 crate5)
   added: (lifting hoist0 crate6) (clear crate5)
   goals met: 0 of 10
4. (load hoist0 crate6 truck1 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck1) (available hoist0)
   goals met: 0 of 10
5. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 0 of 10
6. (unload hoist7 crate6 truck1 distributor0)
   deleted: (in crate6 truck1) (available hoist7)
   added: (lifting hoist7 crate6)
   goals met: 0 of 10
7. (lift hoist9 crate7 crate4 depot1)
   deleted: (at crate7 depot1) (clear crate7) (available hoist9) (on crate7 crate4)
   added: (lifting hoist9 crate7) (clear crate4)
   goals met: 0 of 10
8. (lift hoist1 crate4 crate2 depot1)
   deleted: (at crate4 depot1) (clear crate4) (available hoist1) (on crate4 crate2)
   added: (lifting hoist1 crate4) (clear crate2)
   goals met: 0 of 10
9. (load hoist1 crate4 truck0 depot1)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   goals met: 0 of 10
10. (lift hoist1 crate2 pallet1 depot1)
   deleted: (at crate2 depot1) (clear crate2) (available hoist1) (on crate2 pallet1)
   added: (lifting hoist1 crate2) (clear pallet1)
   goals met: 0 of 10
11. (load hoist1 crate2 truck0 depot1)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck0) (available hoist1)
   goals met: 0 of 10
12. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 0 of 10
13. (drop hoist9 crate7 pallet1 depot1)
   deleted: (lifting hoist9 crate7) (clear pallet1)
   added: (available hoist9) (at crate7 depot1) (clear crate7) (on crate7 pallet1)
   goals met: 1 of 10
14. (unload hoist0 crate2 truck0 depot0)
   deleted: (in crate2 truck0) (available hoist0)
   added: (lifting hoist0 crate2)
   goals met: 1 of 10
15. (drop hoist0 crate2 crate5 depot0)
   deleted: (lifting hoist0 crate2) (clear crate5)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 crate5)
   goals met: 2 of 10
16. (lift hoist8 crate8 crate1 depot2)
   deleted: (at crate8 depot2) (clear crate8) (available hoist8) (on crate8 crate1)
   added: (lifting hoist8 crate8) (clear crate1)
   goals met: 2 of 10
17. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   goals met: 2 of 10
18. (load hoist8 crate8 truck0 depot2)
   deleted: (lifting hoist8 crate8)
   added: (in crate8 truck0) (available hoist8)
   goals met: 2 of 10
19. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 2 of 10
20. (lift hoist8 crate1 pallet2 depot2)
   deleted: (at crate1 depot2) (clear crate1) (available hoist8) (on crate1 pallet2)
   added: (lifting hoist8 crate1) (clear pallet2)
   goals met: 2 of 10
21. (drop hoist2 crate9 pallet2 depot2)
   deleted: (lifting hoist2 crate9) (clear pallet2)
   added: (available hoist2) (at crate9 depot2) (clear crate9) (on crate9 pallet2)
   goals met: 3 of 10
22. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 3 of 10
23. (load hoist8 crate1 truck0 depot2)
   deleted: (lifting hoist8 crate1)
   added: (in crate1 truck0) (available hoist8)
   goals met: 3 of 10
24. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 3 of 10
25. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   goals met: 3 of 10
26. (unload hoist5 crate1 truck0 distributor2)
   deleted: (in crate1 truck0) (available hoist5)
   added: (lifting hoist5 crate1)
   goals met: 3 of 10
27. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   goals met: 3 of 10
28. (drop hoist5 crate1 pallet5 distributor2)
   deleted: (lifting hoist5 crate1) (clear pallet5)
   added: (available hoist5) (at crate1 distributor2) (clear crate1) (on crate1 pallet5)
   goals met: 4 of 10
29. (unload hoist3 crate8 truck0 distributor0)
   deleted: (in crate8 truck0) (available hoist3)
   added: (lifting hoist3 crate8)
   goals met: 4 of 10
30. (load hoist7 crate6 truck1 distributor0)
   deleted: (lifting hoist7 crate6)
   added: (in crate6 truck1) (available hoist7)
   goals met: 4 of 10
31. (drop hoist3 crate8 pallet8 distributor0)
   deleted: (lifting hoist3 crate8) (clear pallet8)
   added: (available hoist3) (at crate8 distributor0) (clear crate8) (on crate8 pallet8)
   goals met: 5 of 10
32. (lift hoist7 crate3 crate0 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist7) (on crate3 crate0)
   added: (lifting hoist7 crate3) (clear crate0)
   goals met: 5 of 10
33. (load hoist7 crate3 truck0 distributor0)
   deleted: (lifting hoist7 crate3)
   added: (in crate3 truck0) (available hoist7)
   goals met: 5 of 10
34. (unload hoist7 crate6 truck1 distributor0)
   deleted: (in crate6 truck1) (available hoist7)
   added: (lifting hoist7 crate6)
   goals met: 5 of 10
35. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 5 of 10
36. (unload hoist9 crate3 truck0 depot1)
   deleted: (in crate3 truck0) (available hoist9)
   added: (lifting hoist9 crate3)
   goals met: 5 of 10
37. (unload hoist1 crate4 truck0 depot1)
   deleted: (in crate4 truck0) (available hoist1)
   added: (lifting hoist1 crate4)
   goals met: 5 of 10
38. (drop hoist9 crate3 pallet7 depot1)
   deleted: (lifting hoist9 crate3) (clear pallet7)
   added: (available hoist9) (at crate3 depot1) (clear crate3) (on crate3 pallet7)
   goals met: 6 of 10
39. (drop hoist1 crate4 crate3 depot1)
   deleted: (lifting hoist1 crate4) (clear crate3)
   added: (available hoist1) (at crate4 depot1) (clear crate4) (on crate4 crate3)
   goals met: 7 of 10
40. (lift hoist3 crate0 pallet3 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist3) (on crate0 pallet3)
   added: (lifting hoist3 crate0) (clear pallet3)
   goals met: 7 of 10
41. (drop hoist3 crate0 crate8 distributor0)
   deleted: (lifting hoist3 crate0) (clear crate8)
   added: (available hoist3) (at crate0 distributor0) (clear crate0) (on crate0 crate8)
   goals met: 8 of 10
42. (drop hoist7 crate6 crate0 distributor0)
   deleted: (lifting hoist7 crate6) (clear crate0)
   added: (available hoist7) (at crate6 distributor0) (clear crate6) (on crate6 crate0)
   goals met: 9 of 10
43. (lift hoist0 crate2 crate5 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 crate5)
   added: (lifting hoist0 crate2) (clear crate5)
   goals met: 8 of 10
44. (drop hoist0 crate2 crate10 depot0)
   deleted: (lifting hoist0 crate2) (clear crate10)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 crate10)
   goals met: 8 of 10
45. (lift hoist0 crate5 pallet6 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist0) (on crate5 pallet6)
   added: (lifting hoist0 crate5) (clear pallet6)
   goals met: 8 of 10
46. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 8 of 10
47. (load hoist0 crate5 truck0 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck0) (available hoist0)
   goals met: 8 of 10
48. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 8 of 10
49. (unload hoist7 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist7)
   added: (lifting hoist7 crate5)
   goals met: 8 of 10
50. (drop hoist7 crate5 pallet3 distributor0)
   deleted: (lifting hoist7 crate5) (clear pallet3)
   added: (available hoist7) (at crate5 distributor0) (clear crate5) (on crate5 pallet3)
   goals met: 9 of 10
51. (lift hoist0 crate2 crate10 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 crate10)
   added: (lifting hoist0 crate2) (clear crate10)
   goals met: 9 of 10
52. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 9 of 10
53. (load hoist0 crate2 truck0 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck0) (available hoist0)
   goals met: 9 of 10
54. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 9 of 10
55. (unload hoist7 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist7)
   added: (lifting hoist7 crate2)
   goals met: 9 of 10
56. (drop hoist7 crate2 crate5 distributor0)
   deleted: (lifting hoist7 crate2) (clear crate5)
   added: (available hoist7) (at crate2 distributor0) (clear crate2) (on crate2 crate5)
   goals met: 10 of 10
